# IFCData Operators (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCData Operators
IFCData Class See Also
---
The IFCData type exposes the following members.
# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Determines whether two IFCDatas are the same. |
| Inequality | Determines whether two IFCDatas are different. |

# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace